Tekla.Structures.Drawing.Text.TextAttributes
The TextAttributes class is the attributes class for the text.

Tekla.Structures.Drawing.Text.TextAttributes.Font
The text object's font settings.

Tekla.Structures.Drawing.Text.TextAttributes.Alignment
The text object's alignment (left, center, right).

Tekla.Structures.Drawing.Text.TextAttributes.Angle
The angle of the text frame.

Tekla.Structures.Drawing.Text.TextAttributes.Frame
The frame for the text.

Tekla.Structures.Drawing.Text.TextAttributes.ArrowHead
The arrowhead of the leader line.

Tekla.Structures.Drawing.Text.TextAttributes.PreferredPlacing
The type of placing the object should use.
See the preferred placing types for different types of placing.

Tekla.Structures.Drawing.Text.TextAttributes.PlacingAttributes
The placing attributes that the object should use.
Using these you can specify whether the object is automatically arranged in the drawing or not.

Tekla.Structures.Drawing.Text.TextAttributes.UseWordWrapping
Gets or sets a value indicating whether to [use word wrapping].
true if [use word wrapping]; otherwise, false.

Tekla.Structures.Drawing.Text.TextAttributes.RulerWidth
Gets or sets the width in paper coordinates of the ruler to be used in word wrapping.
The width of the ruler.

Tekla.Structures.Drawing.Text.TextAttributes.TransparentBackground
Gets or sets a value indicating whether the background transparency is enabled for texts.
The text background transparency. (transparent/opaque)

Tekla.Structures.Drawing.Text.TextAttributes.CustomPresentation
Custom presentation GUID to be applied to the object type

Tekla.Structures.Drawing.Text.TextAttributes.#ctor(System.Boolean)
Creates a new default attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.Text.TextAttributes.#ctor
Creates a new default text attributes instance that loads standard attributes.

Tekla.Structures.Drawing.Text.TextAttributes.#ctor(System.String)
Creates a new text attributes instance that loads the specified attributes.
AttributesFile: The attributes file's filename.

Tekla.Structures.Drawing.Text.TextAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
attributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.Text.TextAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.